Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # helm_release.kubernetes_dashboard will be created
+ resource "helm_release" "kubernetes_dashboard" {
      + atomic                     = false
      + chart                      = "kubernetes-dashboard"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kubernetes-dashboard"
      + namespace                  = "platform"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/dashboard/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "api":
                  "containers":
                    "resources":
                      "limits":
                        "cpu": "250m"
                        "memory": "256Mi"
                      "requests":
                        "cpu": "100m"
                        "memory": "128Mi"
                "app":
                  "ingress":
                    "enabled": false
                "kong":
                  "enabled": false
                "metricsScraper":
                  "enabled": true
                "web":
                  "containers":
                    "resources":
                      "limits":
                        "cpu": "150m"
                        "memory": "128Mi"
                      "requests":
                        "cpu": "50m"
                        "memory": "64Mi"
            EOT,
        ]
      + verify                     = false
      + version                    = "7.10.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.vault will be created
+ resource "helm_release" "vault" {
      + atomic                     = false
      + chart                      = "vault"
      + cleanup_on_fail            = true
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "vault"
      + namespace                  = "platform"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.releases.hashicorp.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 900
      + values                     = [
          + <<-EOT
                "global":
                  "tlsDisable": true
                "injector":
                  "enabled": true
                "server":
                  "auditStorage":
                    "enabled": false
                  "dataStorage":
                    "enabled": true
                    "size": "1Gi"
                    "storageClass": "local-path-retain"
                  "ha":
                    "config": |
                      ui = true
                
                      listener "tcp" {
                        address     = "0.0.0.0:8200"
                        tls_disable = "true"
                      }
                
                      storage "raft" {
                        path = "/vault/data"
                      }
                
                      service_registration "kubernetes" {}
                    "enabled": true
                    "raft":
                      "enabled": true
                      "setNodeId": true
                    "replicas": 1
                  "image":
                    "repository": "hashicorp/vault"
                    "tag": "1.20.4"
                  "service":
                    "type": "ClusterIP"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.31.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubectl_manifest.kubero_instance will be created
+ resource "kubectl_manifest" "kubero_instance" {
      + api_version             = (known after apply)
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = (known after apply)
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = (known after apply)
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = (known after apply)
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[0] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoaddonmemcacheds.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoaddonmemcacheds.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoAddonMemcached
                listKind: KuberoAddonMemcachedList
                plural: kuberoaddonmemcacheds
                singular: kuberoaddonmemcached
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoAddonMemcached is the Schema for the kuberoaddonmemcacheds
                      API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoAddonMemcached
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoAddonMemcached
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[1] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoaddonmongodbs.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoaddonmongodbs.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoAddonMongodb
                listKind: KuberoAddonMongodbList
                plural: kuberoaddonmongodbs
                singular: kuberoaddonmongodb
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoAddonMongodb is the Schema for the kuberoaddonmongodbs
                      API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoAddonMongodb
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoAddonMongodb
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[2] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoaddonmysqls.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoaddonmysqls.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoAddonMysql
                listKind: KuberoAddonMysqlList
                plural: kuberoaddonmysqls
                singular: kuberoaddonmysql
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoAddonMysql is the Schema for the kuberoaddonmysqls API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoAddonMysql
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoAddonMysql
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[3] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoaddonpostgres.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoaddonpostgres.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoAddonPostgres
                listKind: KuberoAddonPostgresList
                plural: kuberoaddonpostgres
                singular: kuberoaddonpostgres
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoAddonPostgres is the Schema for the kuberoaddonpostgres
                      API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoAddonPostgres
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoAddonPostgres
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[4] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoaddonrabbitmqs.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoaddonrabbitmqs.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoAddonRabbitmq
                listKind: KuberoAddonRabbitmqList
                plural: kuberoaddonrabbitmqs
                singular: kuberoaddonrabbitmq
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoAddonRabbitmq is the Schema for the kuberoaddonrabbitmqs
                      API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoAddonRabbitmq
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoAddonRabbitmq
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[5] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoaddonredis.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoaddonredis.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoAddonRedis
                listKind: KuberoAddonRedisList
                plural: kuberoaddonredis
                singular: kuberoaddonredis
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoAddonRedis is the Schema for the kuberoaddonredis API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoAddonRedis
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoAddonRedis
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[6] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoapps.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoapps.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoApp
                listKind: KuberoAppList
                plural: kuberoapps
                singular: kuberoapp
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoApp is the Schema for the kuberoapps API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoApp
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoApp
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[7] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberobuilds.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberobuilds.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoBuild
                listKind: KuberoBuildList
                plural: kuberobuilds
                singular: kuberobuild
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoBuild is the Schema for the kuberobuilds API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoBuild
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoBuild
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[8] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberocouchdbs.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberocouchdbs.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoCouchDB
                listKind: KuberoCouchDBList
                plural: kuberocouchdbs
                singular: kuberocouchdb
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoCouchDB is the Schema for the kuberocouchdbs API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoCouchDB
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoCouchDB
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[9] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoelasticsearches.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoelasticsearches.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoElasticsearch
                listKind: KuberoElasticsearchList
                plural: kuberoelasticsearches
                singular: kuberoelasticsearch
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoElasticsearch is the Schema for the kuberoelasticsearches
                      API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoElasticsearch
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoElasticsearch
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[10] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoes.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberoes.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: Kubero
                listKind: KuberoList
                plural: kuberoes
                singular: kubero
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: Kubero is the Schema for the kuberoes API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of Kubero
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of Kubero
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[11] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberokafkas.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberokafkas.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoKafka
                listKind: KuberoKafkaList
                plural: kuberokafkas
                singular: kuberokafka
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoKafka is the Schema for the kuberokafkas API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoKafka
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoKafka
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[12] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberomails.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberomails.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoMail
                listKind: KuberoMailList
                plural: kuberomails
                singular: kuberomail
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoMail is the Schema for the kuberomails API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoMail
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoMail
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[13] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberomemcacheds.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberomemcacheds.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoMemcached
                listKind: KuberoMemcachedList
                plural: kuberomemcacheds
                singular: kuberomemcached
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoMemcached is the Schema for the kuberomemcacheds API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoMemcached
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoMemcached
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[14] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberomongodbs.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberomongodbs.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoMongoDB
                listKind: KuberoMongoDBList
                plural: kuberomongodbs
                singular: kuberomongodb
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoMongoDB is the Schema for the kuberomongodbs API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoMongoDB
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoMongoDB
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[15] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberomysqls.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberomysqls.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoMysql
                listKind: KuberoMysqlList
                plural: kuberomysqls
                singular: kuberomysql
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoMysql is the Schema for the kuberomysqls API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoMysql
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoMysql
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[16] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberopipelines.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberopipelines.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoPipeline
                listKind: KuberoPipelineList
                plural: kuberopipelines
                singular: kuberopipeline
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoPipeline is the Schema for the kuberopipelines API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoPipeline
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoPipeline
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[17] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberopostgresqls.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apiextensions.k8s.io/v1
            kind: CustomResourceDefinition
            metadata:
              name: kuberopostgresqls.application.kubero.dev
            spec:
              group: application.kubero.dev
              names:
                kind: KuberoPostgresql
                listKind: KuberoPostgresqlList
                plural: kuberopostgresqls
                singular: kuberopostgresql
              scope: Namespaced
              versions:
              - name: v1alpha1
                schema:
                  openAPIV3Schema:
                    description: KuberoPostgresql is the Schema for the kuberopostgresqls API
                    properties:
                      apiVersion:
                        description: 'APIVersion defines the versioned schema of this representation
                          of an object. Servers should convert recognized schemas to the latest
                          internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
                        type: string
                      kind:
                        description: 'Kind is a string value representing the REST resource this
                          object represents. Servers may infer this from the endpoint the client
                          submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
                        type: string
                      metadata:
                        type: object
                      spec:
                        description: Spec defines the desired state of KuberoPostgresql
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                      status:
                        description: Status defines the observed state of KuberoPostgresql
                        type: object
                        x-kubernetes-preserve-unknown-fields: true
                    type: object
                served: true
                storage: true
                subresources:
                  status: {}
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[18] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apiextensions.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CustomResourceDefinition"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kuberoprometheuses.application.kubero.dev"
      + namespace               = (known after apply)
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_bod
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.